    using System;
    
    public class SortProblem
    {
        public static void Main()
        {
            Sort();
            Console.ReadKey();
        }
        public static void Sort()
        {
            var a = new[]
            {
                10, 10, 5, 2, 2, 5, 6, 7, 8, 15, 4, 4, 4, 2, 3, 5, 5, 36, 32, 623, 7, 475, 7, 2, 2, 44, 5, 6, 7, 71, 2
            };
            
            for (int i = 0, n = a.Length; i < n; i++) /*"індекс" = 0*/
            {
                int PresentMax = 0, maxPos = 0, b; 
                /*Знаходить у списку найбільше значення таке,
                що його позиція дорівнює або більша за "index"
                (справа від елемента на позиції "індекс")*/
    
                for (int j = i; j < n; j++) /*Міняє його місцями з елементом масиву на позиції "індекс"*/
                {
                    if (PresentMax < a[j]) /*Збільшує "індекс" на 1*/
                    {
                        PresentMax = a[j];
                        maxPos = j;
                    }
                }
                Console.Write($"{maxPos} "); /*всі позиції максимального елемента змінної і пробіл після неї*/
                /*Рядок, який передує символ $ називається Інтерпольований рядок.
                 Інтерпольовані рядки можуть містити вирази взяті у фігурні дужки {}*/
                b = a[i];
                a[i] = a[maxPos];
                a[maxPos] = b; /*Повторює три попередніх кроки, доки масив не завершиться*/
            }
            Console.WriteLine();
            /*всі елементи відсортованого масиву*/
            for (int i = 0, n = a.Length; i < n; i++)
            {
                Console.Write($"{a[i]} ");
            }
        }
    }
